app/controllers/users_controller.rb

  def index
    @users = User.all.page(params[:page]).per(2)
---
SELECT "users".* FROM "users"
SELECT COUNT(*) FROM "users"

  def create
    @user = User.new(user_params)

    if @user.save
---
INSERT INTO "users" ("name", "phone", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Meet"], ["phone", "1234567890"], ["created_at", "2021-07-15 01:30:02.415974"], ["updated_at", "2021-07-15 01:30:02.415974"]]